package tg.configshop.constants;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum MessageText {
    START_TEXT_ACTIVE("""
                Приветствуем, %s
                
                Ваша подписка активна до %s (МСК)
                
                Выберите действие:
                """),
    START_TEXT_EXPIRED("""
            Приветствуем, %s
            
            У Вас нет активной подписки на данный момент
            
            Выберите действие:
            """),
    BALANCE_MENU("""
            💰 <b>Ваш баланс:</b> %s ₽
            
            Здесь Вы можете пополнить счет и посмотреть историю операций
            """),

    CHOOSE_PAYMENT_METHOD("""
            💳 <b>Пополнение баланса</b>
            
            Выберите удобный способ оплаты:
            """),
    INPUT_SUM_PAYMENT("""
            💰 <b>Введите сумму пополнения</b>
            
            Укажите сумму в рублях одним числом.
            """),
    PAYMENT_DESCRIPTION("Пополнение баланса клиента %s"),
    NUMBER_FORMAT_ERROR("""
            ⚠️ <b>Неверный формат суммы</b>
            
            Введите число без разделителей и лишних символов (пример: <code>1000</code>).
            """),
    SUM_PAY_ERROR("""
            ⚠️ <b>Неверная сумма пополнения</b>
            
            Сумма пополнения должна быть в диапазоне <b>%s–%s ₽</b>.
            """),
    PAYMENT_INSTRUCTION("""
            💸 <b>Пополнение счёта</b>
            
            💰 Сумма: <b>%d ₽</b>
            🆔 ID транзакции: <code>%s</code>
            
            ℹ️ <b>Инструкция:</b>
            1. Нажмите кнопку <b>"Оплатить"</b> ниже.
            2. Следуйте указаниям платежной системы.
            3. После оплаты вернитесь к боту и нажмите <b>"Проверить оплату"</b>.
            """),
    CONFIRMED_PAY("""
            ✅ <b>Оплата успешно выполнена</b>
            
            Средства зачислены на Ваш баланс.
            """),
    CANCELED_PAY("""
            ❌ <b>Оплата не выполнена</b>
            
            Срок действия ссылки истек или оплата была отменена.
            """),
    PROCESSING_PAY("""
            ⏳ Платёж в обработке
            
            Транзакция обрабатывается, попробуйте проверить оплату позже (1–5 минут).
            """),
    EXPIRED_PAY("""
            ♻️ Платёж уже обработан
            
            Данная оплата была зачислена ранее.
            """),
    REFERRAL_MENU("""
            🤝 <b>Партнерская программа</b>
            
            📊 <b>Ваша статистика:</b>
            • Приглашено пользователей: <b>%d</b>
            • Активных рефералов: <b>%d</b>
            • Доход: <b>%d ₽</b>
            • Доступно к выводу: <b>%d ₽</b>
            
            🏷 <b>Ваш промокод:</b> %s
            
            ℹ️ <b>Как это работает?</b>
            1. Реферал активирует Ваш промокод и получает <b>100 ₽</b> на баланс.
            2. Реферал навсегда закрепляется за Вами.
            3. Вы получаете <b>%d%%</b> с каждого пополнения Реферала.
            4. А также <b>%d%%</b> от Рефералов вашего Реферала и <b>%d%%</b> от их Рефералов!
            
            🔗 <b>Ваша пригласительная ссылка:</b>
            <code>%s</code>
            """),
    REFERRAL_MENU_MANY_CODES("""
            🤝 <b>Партнерская программа</b>
            
            📊 <b>Ваша статистика:</b>
            • Приглашено пользователей: <b>%d</b>
            • Активных рефералов: <b>%d</b>
            • Доход: <b>%d ₽</b>
            • Доступно к выводу: <b>%d ₽</b>
            
            🏷 <b>Ваши промокоды:</b> %s
            
            ℹ️ <b>Как это работает?</b>
            1. Реферал активирует Ваш промокод и получает <b>100 ₽</b> на баланс.
            2. Реферал навсегда закрепляется за Вами.
            3. Вы получаете <b>%d%%</b> с каждого пополнения Реферала.
            4. А также <b>%d%%</b> от Рефералов вашего Реферала и <b>%d%%</b> от их Рефералов!
            
            🔗 <b>Ваша пригласительная ссылка:</b>
            <code>%s</code>
            """),
    REFERRAL_LIST("""
            👥 <b>Ваши рефералы</b>
            
            <i>Список представлен в порядке регистрации от новых к старым</i>
            """),
    REFERRAL_LIST_EMPTY("""
            <i>Ваш реферальный список пуст...</i> 🍃
            """),
    REFERRAL_INFO_ACTIVE("""
            🟢 <b>%s</b>
            📶 Уровень: %s
            💸 Доход с реферала: %s ₽
            📆 Зарегистрирован: %s
            """),
    REFERRAL_INFO_INACTIVE("""
            🔴 <b>%s</b>
            📶 Уровень: %s
            💸 Доход с реферала: %s ₽
            📆 Зарегистрирован: %s
            """),
    REFERRAL_REWARD_NOTIFICATION("""
            💸 <b>Реферальное начисление!</b>
            
            Ваш реферал %d-го уровня пополнил баланс на сумму <b>%d ₽</b>
            Вам зачислено <b>%.1f%%</b> с его пополнения
            
            💰 <b>Баланс пополнен на: %d ₽</b>
            """),
    WITHDRAWAL_METHOD("""
        📤 <b>Вывод средств</b>
        
        Выберите способ вывода:
        """),
    CRYPTO_WITHDRAWAL_INPUT("""
        💎 <b>Вывод в криптовалюту</b>
        
        💰 <b>Доступно для вывода:</b> %d ₽
        
        Введите сумму вывода:
        """),
    SUBSCRIPTION("""
                👤 <b>%s</b>
                🆔 <code>%s</code>
                💰 Баланс: <b>%d ₽</b>
                
                📋 <b>Информация о подписке:</b>
                %s Активна до: <b>%s</b>
                ⏳ Осталось: <b>%d дн.</b>
                📊 Трафик: <b>%.2f / %.2f ГБ</b>
                📱 Устройства: <b>%d / %d</b>
                
                <blockquote><b>🔒 Подключенные устройства: </b>
                %s</blockquote>
                
                🔗 <b>Ключ для подключения:</b>
                <pre><code class="копировать">%s</code></pre>
                """),


    SUBSCRIPTION_TRIAL("""
                👤 <b>%s</b>
                🆔 <code>%s</code>
                💰 Баланс: <b>%d ₽</b>
                
                📋 <b>Пробный период:</b>
                %s Активен до: <b>%s</b>
                ⏳ Осталось: <b>%d дн.</b>
                📊 Трафик: <b>%.2f / %.2f ГБ</b>
                📱 Устройства: <b>%d / %d</b>
                
                ✨ <i>При покупке любой подписки трафик станет безлимитным!</i>
                
                <blockquote><b>🔒 Подключенные устройства: </b>
                %s</blockquote>
                
                🔗 <b>Ключ для подключения:</b>
                <pre><code class="копировать">%s</code></pre>
                """),
    DEVICES_MENU("""
            📱 <b>Управление устройствами</b>
            
            Здесь Вы можете просмотреть и управлять подключенными устройствами.
            
            Подключено: <b>%d / %d</b>
            
            <blockquote><b>🔒 Подключенные устройства: </b>
            %s</blockquote>
            """),
    DELETE_DEVICES_MENU("""
        🗑️ <b>Удаление устройств</b>
        
        Для удаления устройства нажмите на него в списке ниже.
        
        📱 Подключено: <b>%d</b>
        """),

    BUY_MORE_DEVICES_MENU("""
        ➕ <b>Докупка устройств</b>
        
        💰 <b>Стоимость 1 устройства:</b> %d ₽
        📱 <b>Вы можете докупить:</b> до %d устройств
        
        ℹ️ Стоимость рассчитывается пропорционально оставшемуся сроку подписки.
        
        Выберите количество устройств для покупки:
        """),

    BUY_MORE_DEVICES_NO_SUBSCRIPTION("""
        ⚠️ <b>Невозможно докупить устройства</b>
        
        У вас нет активной подписки. Сначала приобретите базовую подписку.
        """),

    BUY_MORE_DEVICES_MAX_REACHED("""
        ℹ️ <b>Максимальное количество устройств</b>
        
        Вы уже используете максимально возможное количество устройств (%d).
        """),

    DEVICE_DELETED_SUCCESS("""
        ✅ <b>Устройство удалено</b>
        
        Устройство успешно удалено из системы.
        """),

    NO_DEVICES_TO_DELETE("""
        ℹ️ <b>Нет устройств для удаления</b>
        
        У вас пока нет подключенных устройств.
        """),

    DEVICE_PURCHASE_SUCCESS("""
        ✅ <b>Устройства успешно добавлены!</b>
        
        К вашей подписке добавлено устройств: <b>%d</b>
        Списано с баланса: <b>%d ₽</b>
        """),

    DEVICE_PURCHASE_INSUFFICIENT_BALANCE("""
        ❌ <b>Недостаточно средств</b>
        
        Для покупки %d устройств необходимо <b>%d ₽</b>
        На вашем балансе: <b>%d ₽</b>
        """),

    DEVICE_PURCHASE_TOO_MANY("""
        ⚠️ <b>Превышен лимит устройств</b>
        
        Вы пытаетесь добавить слишком много устройств.
        Максимальное количество: <b>%d</b>
        """),

    DEVICE_PURCHASE_CONFIRMATION("""
        🛒 <b>Подтверждение покупки устройств</b>
        
        📱 <b>Количество устройств:</b> %d
        💰 <b>Цена за устройство:</b> %d ₽
        
        💎 <b>Итого к оплате:</b> %d ₽
        
        ℹ️ После подтверждения средства будут списаны с вашего баланса.
        
        Подтвердить покупку?
        """),

    NOTIFICATION_1_DAY_BEFORE("""
        ⏰ <b>Подписка заканчивается завтра</b>
        
        До окончания вашей подписки остался <b>1 день</b>
        
        Не забудьте продлить подписку, чтобы продолжить пользоваться сервисом без перерывов.
        """),

    NOTIFICATION_3_DAYS_BEFORE("""
        📅 <b>Скоро окончание подписки</b>
        
        До окончания вашей подписки осталось <b>3 дня</b>
        
        Рекомендуем заранее продлить подписку для бесперебойного доступа
        """),

    NOTIFICATION_12_HOUR_NO_TRAFFIC("""
        💡 <b>Подключение ещё не настроено?</b>
        
        Мы заметили, что вы пока не используете подписку
        
        Если возникли сложности с подключением — наша поддержка всегда готова помочь!
        """),

    NOTIFICATION_24_HOUR_NO_TRAFFIC("""
        🔧 <b>Нужна помощь с настройкой?</b>
        
        Прошли сутки с момента покупки, но подключение ещё не активно
        
        Обратитесь в техподдержку — мы поможем настроить VPN за несколько минут!
        """),

    NOTIFICATION_48_HOUR_NO_TRAFFIC("""
        ⚠️ <b>Подписка простаивает уже 2 дня</b>
        
        Похоже, у вас возникли сложности с подключением
        
        Свяжитесь с нашей поддержкой — мы обязательно решим проблему!
        """),

    EMPTY_DEVICES("<i>Устройств пока нет. Подключите первое устройство с помощью кнопки ниже.</i>"),
    PROMO_CODE_REQUEST("""
                🏷 <b>Активация промокода</b>
                
                Пожалуйста, отправьте Ваш промокод в чат.
                """),

    PROMO_CODE_ALERT("""
            🏷 <b>Отправьте промокод</b>
            
            Пожалуйста, отправьте Ваш промокод отдельным сообщением в чат.
            """),

    PROMO_SUCCESS("✅ <b>Промокод успешно активирован!</b>\nСредства зачислены на Ваш баланс"),

    PROMO_NOT_FOUND("❌ <b>Промокод не найден.</b>\nПроверьте правильность ввода"),

    PROMO_ALREADY_USED("⚠️ <b>Вы уже активировали этот промокод</b>"),

    PROMO_ENDED("⏳ <b>Срок действия или лимит активаций исчерпан</b>"),

    REFERRAL_PROMO_ALREADY_USED("👥 <b>Вы уже активировали реферальный промокод</b>"),

    CYCLIC_REFERRAL_EXCEPTION("🔄 <b>Вы пытаетесь использовать промокод кого-то из своих рефералов</b>"),

    SELF_REFERRAL_EXCEPTION("🌼 <b>Нельзя использовать собственный реферальный код</b>"),

    PROMO_ERROR("❌ <b>Произошла ошибка при активации.</b>\nОбратитесь в поддержку"),

    BUY_SUBSCRIPTION_MENU_PERIOD("""
            🛒 <b>Покупка / Продление подписки</b>
            
            Выберите срок действия вашей подписки:
            """),

    BUY_SUBSCRIPTION_MENU_DEVICE("""
            🛒 <b>Покупка / Продление подписки</b>
            
            Выберите количество устройств:
            """),

    CONFIRM_BUY_SUMMARY("""
            📝 <b>Подтверждение покупки</b>
            
            📅 <b>Период:</b> %s
            ♾ <b>Трафик:</b> Безлимитный
            📱 <b>Устройства:</b> %d
            
            💰 <b>Детализация стоимости:</b>
            • Базовый тариф: <b>%d ₽</b>
            • Доп. устройства (%d шт): <b>%d ₽</b>
            
            💎 <b>Итого к оплате:</b> %d ₽
            """),

    PURCHASE_SUCCESS("""
            ✅ <b>Покупка успешно выполнена!</b>
            
            Ваша подписка обновлена. Приятного использования!
            """),
    INSUFFICIENT_BALANCE("""
            ❌ <b>Недостаточно средств</b>
            
            Для покупки этого тарифа пополните Ваш баланс.
            """),
    UNKNOWN_ERROR("""
            ❌ <b>Произошла ошибка</b>
            
            Попробуйте позже или обратитесь в поддержку.
            """),

    DOCS_DECLINE("""
            ⚠️ Доступ к боту ограничен
            
            Вы не сможете пользоваться ботом, пока не примете условия Пользовательского соглашения и Политики конфиденциальности.
            """),

    REFERRAL_CREATED_LINK("""
            👥 <b>Новый реферал!</b>
            
            <a href="tg://user?id=%s">%s</a> стал Вашим рефералом, перейдя по пригласительной ссылке!
            
            Теперь Вы будете получать прибыль с каждого его пополнения
            """),
    REFERRAL_CREATED_PROMO("""
            👥 <b>Новый реферал!</b>
            
            <a href="tg://user?id=%s">%s</a> стал Вашим рефералом, введя ваш промокод %s!
            
            Теперь Вы будете получать прибыль с каждого его пополнения
            """),
    START_LEGAL_NOTICE("""
        👋 Здравствуйте, %s!
        
        Для использования бота необходимо принять условия:
        1. <a href="%s">Пользовательское соглашение</a>
        2. <a href="%s">Политика конфиденциальности</a>
        """ + "\nНажимая кнопку <i>\"" + ButtonText.ACCEPT_RULES.getText() + "\",</i> Вы соглашаетесь с правилами Сервиса."),

    LEGAL_TEXT("""
            1. <a href="%s">Пользовательское соглашение</a>
            2. <a href="%s">Политика конфиденциальности</a>
            """),

    BROADCAST_USAGE("""
            ❌ <b>Неверное использование команды</b>
            
            Использование: <code>%s &lt;текст в HTML&gt;</code>
            """),

    BROADCAST_TEXT_NOT_FOUND("""
            ❌ <b>Ошибка</b>
            
            Текст для рассылки не найден.
            """),

    BROADCAST_NO_USERS("""
            ❌ <b>Невозможно выполнить рассылку</b>
            
            В базе данных нет пользователей для отправки сообщений.
            """),

    BROADCAST_START("""
            ✅ <b>Начинаю рассылку</b>
            
            Сообщение будет отправлено <b>%d</b> пользователям...
            """),

    BROADCAST_REPORT("""
            📊 Рассылка завершена:
            ✅ Отправлено: %d
            ❌ Ошибки: %d
            🚫 Заблокировали: %d
            """),

    HISTORY_HEADER("""
            📜 <b>История операций</b>

            💰 <b>Текущий баланс:</b> %d ₽
            
            <blockquote>%s</blockquote>
            """),

    HISTORY_TOP_UP("""
            <b>🟢 Пополнение</b>
            + %s ₽
            %s
            %s
            """),
    HISTORY_PURCHASE("""
            <b>🔴 Покупка</b>
            - %s ₽
            %s
            %s
            """),
    HISTORY_WITHDRAW("""
            <b>🟡 Вывод средств</b>
            %s ₽
            %s
            %s
            """),

    HISTORY_REFERRAL("Реферальное пополнение"),
    HISTORY_EXTERNAL("Пополнение баланса"),
    HISTORY_PROMO_CODE("Применение промокода"),
    HISTORY_ADMIN("Пополнение администратором"),

    HISTORY_DEVICE("Покупка дополнительных устройств (%s шт.)"),
    HISTORY_SUBSCRIPTION("Покупка подписки на %s дней и %s устройств(а)"),

    HISTORY_DONE ("Выполнен"),
    HISTORY_IN_PROGRESS ("В ожидании"),
    HISTORY_REJECTED ("Отклонён"),
    HISTORY_EMPTY("""
            🗑 <b>История пуста</b>
            
            Вы еще не совершали операций.
            """),
    INPUT_REF_PROMO_NOTIFY("Введите код в чат"),

    INPUT_REF_PROMO("""
            🏷 <b>Создание реферального промокода</b>
            
            Вы можете придумать свой уникальный промокод для привлечения рефералов (например: <code>SUPER_PROMO</code>).
            
            ℹ️ <b>Лимит:</b> 10 активных промокодов.
            
            <b>Введите желаемое название промокода, длинной от 3 до 20 символов:</b>
            """),

    ADD_REF_PROMO_SUCCESS("""
            ✅ <b>Промокод успешно создан!</b>
            
            Теперь вы можете распространять его и получать бонусы с приглашенных пользователей.
            """),

    TOO_MANY_REFERRAL_PROMO("""
            ⚠️ <b>Достигнут лимит промокодов</b>
            
            У Вас уже создано максимальное количество реферальных промокодов (10 шт).
            
            Для создания нового необходимо удалить один из старых.
            """),

    PROMO_CODE_ALREADY_EXIST("""
            ❌ <b>Промокод уже занят</b>
            
            К сожалению, такой промокод уже существует в системе.
            Пожалуйста, придумайте другое название.
            """),

    UNKNOWN_ERROR_REF_PROMO("""
            🚫 <b>Ошибка создания</b>
            
            Не удалось создать промокод. Попробуйте повторить попытку позже или обратитесь в поддержку.
            """),
    INVALID_SYMBOLS_USE("""
            ⚠️ <b>Некорректный формат</b>
            
            Промокод может содержать только <b>латинские буквы, цифры, символы _ и -</b>.
            Длина: от <b>3</b> до <b>20</b> символов.
            
            Пример: <code>SUPER_PROMO</code>
            """),

    WITHDRAWAL_SUM_TOO_SMALL("""
            ⚠️ <b>Сумма слишком мала</b>
            
            Минимальная сумма для вывода: <b>%d ₽</b>
            Введите другую сумму:
            """),

    WITHDRAWAL_INSUFFICIENT_FUNDS("""
            ⚠️ <b>Недостаточно средств</b>
            
            Доступно для вывода: <b>%d ₽</b>
            Вы пытаетесь вывести: <b>%d ₽</b>
            
            Введите корректную сумму:
            """),

    WITHDRAWAL_FORMAT_ERROR("""
            ⚠️ <b>Ошибка формата</b>
            
            Пожалуйста, отправьте целое число без букв и символов.
            Пример: <code>5000</code>
            """),

    CRYPTO_WALLET_INPUT("""
            💎 <b>Вывод %d ₽</b>
            
            Введите адрес вашего кошелька <b>USDT TRC20</b>.
            
            ⚠️ <i>Будьте внимательны! При ошибке в адресе средства будут утеряны безвозвратно.</i>
            """),

    WITHDRAWAL_CONFIRMATION("""
            📝 <b>Подтверждение заявки на вывод</b>
            
            💰 Сумма: <b>%d ₽</b>
            💎 Тип: <b>USDT TRC20</b>
            
            👛 Кошелек:
            <code>%s</code>
            
            ⚠️ <i>Проверьте данные! Отменить операцию будет невозможно.</i>
            """),

    WITHDRAWAL_CREATED("""
            ✅ <b>Заявка на вывод создана</b>
            
            🆔 ID: <code>%s</code>
            💰 Сумма: <b>%d ₽</b>
            
            Ваша заявка будет рассмотрена в течение недели, ожидайте
            """),

    ADMIN_NEW_WITHDRAWAL("""
            🔔 <b>Новая заявка на вывод!</b>
            
            🆔 ID: <code>%s</code>
            👤 Пользователь: <a href="tg://user?id=%d">%s</a> (ID: %d)
            
            💰 Сумма: <b>%d ₽</b>
            💠 Тип: <b>%s</b>
            📋 Реквизиты:
            <code>%s</code>
            
            ⏳ Статус: <b>%s</b>
            """),

    USER_WITHDRAWAL_APPROVED("""
            ✅ <b>Вывод средств выполнен!</b>
            
            Ваша заявка (ID: <code>%s</code>) на сумму <b>%d ₽</b> успешно обработана.
            Средства отправлены на ваши реквизиты.
            """),

    USER_WITHDRAWAL_REJECTED("""
            ❌ <b>Заявка на вывод отклонена</b>
            
            Ваша заявка (ID: <code>%s</code>) была отклонена администратором.
            💰 Средства возвращены на баланс бота.
            """),

    ADMIN_ACTION_ERROR("⚠️ <b>Ошибка:</b> заявка уже обработана кем-то другим."),

    ADMIN_STATUS_UPDATED("🔄 Статус обновлен."),

    WITHDRAWAL_ERROR("❌ <b>Ошибка при обработке вывода.</b>\nПопробуйте позже."),
    UNKNOWN_COMMAND("""
            ❓ <b>Неизвестная команда</b>
            
            Команда не распознана, пожалуйста, повторите ввод или воспользуйтесь меню.
            """),

    ALERT_MESSAGE("""
            ⚠️ <b>Произошла неизвестная ошибка!</b>
            
            userId: %d
            username: @%s
            error: %s
            """);

    private final String messageText;

}
